Revit 2027 API
PointCloudEngineRegistry.UnregisterPointCloudEngine Method
 Unregisters the point cloud engine associated to a particular identifier.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void UnregisterPointCloudEngine(
	string identifier
)
Public Shared Sub UnregisterPointCloudEngine (
	identifier As String
)
public:
static void UnregisterPointCloudEngine(
	String^ identifier
)
static member UnregisterPointCloudEngine :
        identifier : string -> unit
Parameters
identifier String
 The identifier of the engine to be unregistered.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace